---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionTypeInfoNotAvailable
source: html/c78fb3ec-b0fc-03da-542f-d4dace6ba48e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionTypeInfoNotAvailable Property

There is no add-on installed which supports Structural Connection type.

## Syntax (C#)
```csharp
public static FailureDefinitionId StructuralConnectionTypeInfoNotAvailable { get; }
```